SAR-mango/SinESC/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/MCLibrary/stm32f30x_MisraCompliance.h
#define SRAM_BB_BASE          ((uint32_t)0x22000000u) /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE        ((uint32_t)0x42000000u) /*!< Peripheral base address in the bit-band region */


/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000u)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000u)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000u)
#define AHB3PERIPH_BASE       (PERIPH_BASE + 0x10000000u)

/*!< APB1 peripherals */
#define TIM2_BASE             (APB1PERIPH_BASE + 0x00000000u)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x00000400u)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x00000800u)
#define TIM6_BASE             (APB1PERIPH_BASE + 0x00001000u)
#define TIM7_BASE             (APB1PERIPH_BASE + 0x00001400u)
#define RTC_BASE              (APB1PERIPH_BASE + 0x00002800u)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x00002C00u)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x00003000u)
#define I2S2ext_BASE          (APB1PERIPH_BASE + 0x00003400u)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x00003800u)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x00003C00u)
#define I2S3ext_BASE          (APB1PERIPH_BASE + 0x00004000u)
#define USART2_BASE           (APB1PERIPH_BASE + 0x00004400u)
#define USART3_BASE           (APB1PERIPH_BASE + 0x00004800u)
#define UART4_BASE            (APB1PERIPH_BASE + 0x00004C00u)
#define UART5_BASE            (APB1PERIPH_BASE + 0x00005000u)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x00005400u)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x00005800u)
#define CAN1_BASE             (APB1PERIPH_BASE + 0x00006400u)
#define PWR_BASE              (APB1PERIPH_BASE + 0x00007000u)
#define DAC1_BASE             (APB1PERIPH_BASE + 0x00007400u)
#define I2C3_BASE             (APB1PERIPH_BASE + 0x00007800u)
#define DAC2_BASE             (APB1PERIPH_BASE + 0x00009800u)
#define DAC_BASE               DAC1_BASE

/*!< APB2 peripherals */
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x00000000u)
#define COMP_BASE             (APB2PERIPH_BASE + 0x0000001Cu)
#define COMP1_BASE            (APB2PERIPH_BASE + 0x0000001Cu)
#define COMP2_BASE            (APB2PERIPH_BASE + 0x00000020u)
#define COMP3_BASE            (APB2PERIPH_BASE + 0x00000024u)
#define COMP4_BASE            (APB2PERIPH_BASE + 0x00000028u)
#define COMP5_BASE            (APB2PERIPH_BASE + 0x0000002Cu)
#define COMP6_BASE            (APB2PERIPH_BASE + 0x00000030u)
#define COMP7_BASE            (APB2PERIPH_BASE + 0x00000034u)
#define OPAMP_BASE            (APB2PERIPH_BASE + 0x00000038u)
#define OPAMP1_BASE           (APB2PERIPH_BASE + 0x00000038u)
#define OPAMP2_BASE           (APB2PERIPH_BASE + 0x0000003Cu)
#define OPAMP3_BASE           (APB2PERIPH_BASE + 0x00000040u)
#define OPAMP4_BASE           (APB2PERIPH_BASE + 0x00000044u)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x00000400u)
#define TIM1_BASE             (APB2PERIPH_BASE + 0x00002C00u)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x00003000u)
#define TIM8_BASE             (APB2PERIPH_BASE + 0x00003400u)
#define USART1_BASE           (APB2PERIPH_BASE + 0x00003800u)
#define TIM15_BASE            (APB2PERIPH_BASE + 0x00004000u)
#define TIM16_BASE            (APB2PERIPH_BASE + 0x00004400u)
#define TIM17_BASE            (APB2PERIPH_BASE + 0x00004800u)

/*!< AHB1 peripherals */
#define DMA1_BASE             (AHB1PERIPH_BASE + 0x00000000u)
#define DMA1_Channel1_BASE    (AHB1PERIPH_BASE + 0x00000008u)
#define DMA1_Channel2_BASE    (AHB1PERIPH_BASE + 0x0000001Cu)
#define DMA1_Channel3_BASE    (AHB1PERIPH_BASE + 0x00000030u)
#define DMA1_Channel4_BASE    (AHB1PERIPH_BASE + 0x00000044u)
#define DMA1_Channel5_BASE    (AHB1PERIPH_BASE + 0x00000058u)
#define DMA1_Channel6_BASE    (AHB1PERIPH_BASE + 0x0000006Cu)
#define DMA1_Channel7_BASE    (AHB1PERIPH_BASE + 0x00000080u)
#define DMA2_BASE             (AHB1PERIPH_BASE + 0x00000400u)
#define DMA2_Channel1_BASE    (AHB1PERIPH_BASE + 0x00000408u)
#define DMA2_Channel2_BASE    (AHB1PERIPH_BASE + 0x0000041Cu)
#define DMA2_Channel3_BASE    (AHB1PERIPH_BASE + 0x00000430u)
#define DMA2_Channel4_BASE    (AHB1PERIPH_BASE + 0x00000444u)
#define DMA2_Channel5_BASE    (AHB1PERIPH_BASE + 0x00000458u)
#define RCC_BASE              (AHB1PERIPH_BASE + 0x00001000u)
#define FLASH_R_BASE          (AHB1PERIPH_BASE + 0x00002000u) /*!< Flash registers base address */
#define OB_BASE               ((uint32_t)0x1FFFF800u)     /*!< Flash Option Bytes base address */
#define CRC_BASE              (AHB1PERIPH_BASE + 0x00003000u)
#define TSC_BASE              (AHB1PERIPH_BASE + 0x00004000u)

/*!< AHB2 peripherals */
#define GPIOA_BASE            (AHB2PERIPH_BASE + 0x0000u)
#define GPIOB_BASE            (AHB2PERIPH_BASE + 0x0400u)
#define GPIOC_BASE            (AHB2PERIPH_BASE + 0x0800u)
#define GPIOD_BASE            (AHB2PERIPH_BASE + 0x0C00u)
#define GPIOE_BASE            (AHB2PERIPH_BASE + 0x1000u)
#define GPIOF_BASE            (AHB2PERIPH_BASE + 0x1400u)

/*!< AHB3 peripherals */
#define ADC1_BASE             (AHB3PERIPH_BASE + 0x0000u)
#define ADC2_BASE             (AHB3PERIPH_BASE + 0x0100u)
#define ADC1_2_BASE           (AHB3PERIPH_BASE + 0x0300u)
#define ADC3_BASE             (AHB3PERIPH_BASE + 0x0400u)
#define ADC4_BASE             (AHB3PERIPH_BASE + 0x0500u)
#define ADC3_4_BASE           (AHB3PERIPH_BASE + 0x0700u)

#define DBGMCU_BASE          ((uint32_t)0xE0042000u) /*!< Debug MCU registers base address */
/**
  * @}
  */
  
/** @addtogroup Peripheral_declaration
  * @{
  */  
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDG                ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)
#define I2S2ext             ((SPI_TypeDef *) I2S2ext_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define I2S3ext             ((SPI_TypeDef *) I2S3ext_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define USART3              ((USART_TypeDef *) USART3_BASE)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define UART5               ((USART_TypeDef *) UART5_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define CAN1                ((CAN_TypeDef *) CAN1_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define DAC1                ((DAC_TypeDef *) DAC1_BASE)
#define DAC2                ((DAC_TypeDef *) DAC2_BASE)
#define DAC                  DAC1
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define COMP                ((COMP_TypeDef *) COMP_BASE)
#define COMP1               ((COMP_TypeDef *) COMP1_BASE)
#define COMP2               ((COMP_TypeDef *) COMP2_BASE)
#define COMP3               ((COMP_TypeDef *) COMP3_BASE)
#define COMP4               ((COMP_TypeDef *) COMP4_BASE)
#define COMP5               ((COMP_TypeDef *) COMP5_BASE)
#define COMP6               ((COMP_TypeDef *) COMP6_BASE)
#define COMP7               ((COMP_TypeDef *) COMP7_BASE)
#define OPAMP               ((OPAMP_TypeDef *) OPAMP_BASE)
#define OPAMP1              ((OPAMP_TypeDef *) OPAMP1_BASE)
#define OPAMP2              ((OPAMP_TypeDef *) OPAMP2_BASE)
#define OPAMP3              ((OPAMP_TypeDef *) OPAMP3_BASE)
#define OPAMP4              ((OPAMP_TypeDef *) OPAMP4_BASE)
#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
#define TIM1                ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define TIM8                ((TIM_TypeDef *) TIM8_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define TIM15               ((TIM_TypeDef *) TIM15_BASE)
#define TIM16               ((TIM_TypeDef *) TIM16_BASE)
#define TIM17               ((TIM_TypeDef *) TIM17_BASE)
#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)
#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel1       ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5       ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6       ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7       ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)
#define DMA2                ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Channel1       ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE)
#define DMA2_Channel2       ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE)
#define DMA2_Channel3       ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE)
#define DMA2_Channel4       ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE)
#define DMA2_Channel5       ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE)
#define RCC                 ((RCC_TypeDef *) RCC_BASE)
#define FLASH               ((FLASH_TypeDef *) FLASH_R_BASE)
#define OB                  ((OB_TypeDef *) OB_BASE)
#define CRC                 ((CRC_TypeDef *) CRC_BASE)
#define TSC                 ((TSC_TypeDef *) TSC_BASE)
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF               ((GPIO_TypeDef *) GPIOF_BASE)
#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                ((ADC_TypeDef *) ADC2_BASE)
#define ADC3                ((ADC_TypeDef *) ADC3_BASE)
#define ADC4                ((ADC_TypeDef *) ADC4_BASE)
#define ADC1_2              ((ADC_Common_TypeDef *) ADC1_2_BASE)
#define ADC3_4              ((ADC_Common_TypeDef *) ADC3_4_BASE)
/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */
  
  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */
    
/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter SAR (ADC)               */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for ADC_ISR register  ********************/
#define ADC_ISR_ADRD          ((uint32_t)0x00000001)   /*!< ADC Ready (ADRDY) flag  */
#define ADC_ISR_EOSMP         ((uint32_t)0x00000002) /*!< ADC End of Sampling flag */
#define ADC_ISR_EOC           ((uint32_t)0x00000004) /*!< ADC End of Regular Conversion flag */
#define ADC_ISR_EOS           ((uint32_t)0x00000008) /*!< ADC End of Regular sequence of Conversions flag */
#define ADC_ISR_OVR           ((uint32_t)0x00000010) /*!< ADC overrun flag */
#define ADC_ISR_JEOC          ((uint32_t)0x00000020) /*!< ADC End of Injected Conversion flag */
#define ADC_ISR_JEOS          ((uint32_t)0x00000040) /*!< ADC End of Injected sequence of Conversions flag */
#define ADC_ISR_AWD1          ((uint32_t)0x00000080) /*!< ADC Analog watchdog 1 flag */
#define ADC_ISR_AWD2          ((uint32_t)0x00000100) /*!< ADC Analog watchdog 2 flag */
#define ADC_ISR_AWD3          ((uint32_t)0x00000200) /*!< ADC Analog watchdog 3 flag */
#define ADC_ISR_JQOVF         ((uint32_t)0x00000400) /*!< ADC Injected Context Queue Overflow flag */

/********************  Bit definition for ADC_IER register  ********************/
#define ADC_IER_RDY           ((uint32_t)0x00000001) /*!< ADC Ready (ADRDY) interrupt source */
#define ADC_IER_EOSMP         ((uint32_t)0x00000002) /*!< ADC End of Sampling interrupt source */
#define ADC_IER_EOC           ((uint32_t)0x00000004) /*!< ADC End of Regular Conversion interrupt source */
#define ADC_IER_EOS           ((uint32_t)0x00000008) /*!< ADC End of Regular sequence of Conversions interrupt source */
#define ADC_IER_OVR           ((uint32_t)0x00000010) /*!< ADC overrun interrupt source */
#define ADC_IER_JEOC          ((uint32_t)0x00000020) /*!< ADC End of Injected Conversion interrupt source */
#define ADC_IER_JEOS          ((uint32_t)0x00000040) /*!< ADC End of Injected sequence of Conversions interrupt source */
#define ADC_IER_AWD1          ((uint32_t)0x00000080) /*!< ADC Analog watchdog 1 interrupt source */
#define ADC_IER_AWD2          ((uint32_t)0x00000100) /*!< ADC Analog watchdog 2 interrupt source */
#define ADC_IER_AWD3          ((uint32_t)0x00000200) /*!< ADC Analog watchdog 3 interrupt source */
#define ADC_IER_JQOVF         ((uint32_t)0x00000400) /*!< ADC Injected Context Queue Overflow interrupt source */

/********************  Bit definition for ADC_CR register  ********************/
#define ADC_CR_ADEN          ((uint32_t)0x00000001) /*!< ADC Enable control */
#define ADC_CR_ADDIS         ((uint32_t)0x00000002) /*!< ADC Disable command */
#define ADC_CR_ADSTART       ((uint32_t)0x00000004) /*!< ADC Start of Regular conversion */
#define ADC_CR_JADSTART      ((uint32_t)0x00000008) /*!< ADC Start of injected conversion */
#define ADC_CR_ADSTP         ((uint32_t)0x00000010) /*!< ADC Stop of Regular conversion */
#define ADC_CR_JADSTP        ((uint32_t)0x00000020) /*!< ADC Stop of injected conversion */
#define ADC_CR_ADVREGEN      ((uint32_t)0x30000000) /*!< ADC Voltage regulator Enable */
#define ADC_CR_ADVREGEN_0    ((uint32_t)0x10000000) /*!< ADC ADVREGEN bit 0 */
#define ADC_CR_ADVREGEN_1    ((uint32_t)0x20000000) /*!< ADC ADVREGEN bit 1 */
#define ADC_CR_ADCALDIF      ((uint32_t)0x40000000) /*!< ADC Differential Mode for calibration */
#define ADC_CR_ADCAL         ((uint32_t)0x80000000) /*!< ADC Calibration */

